# GetValues Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..GetValues Method
ExportLinetypeTable Class See Also
---
Returns all the values stored in the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<ExportLinetypeInfo> GetValues()
```

Visual Basic
---
```text
Public Function GetValues As IList(Of ExportLinetypeInfo)
```

Visual C++
---
```text
public:
IList<ExportLinetypeInfo^>^ GetValues()
```

# ### Return Value
The info.
# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace